package pkg

// 六神配置 (根据日干)
var (
	LiuShenConfig = map[string][]string{
		"甲": {"青龙", "朱雀", "勾陈", "螣蛇", "白虎", "玄武"},
		"乙": {"青龙", "朱雀", "勾陈", "螣蛇", "白虎", "玄武"},
		"丙": {"朱雀", "勾陈", "螣蛇", "白虎", "玄武", "青龙"},
		"丁": {"朱雀", "勾陈", "螣蛇", "白虎", "玄武", "青龙"},
		"戊": {"勾陈", "螣蛇", "白虎", "玄武", "青龙", "朱雀"},
		"己": {"螣蛇", "白虎", "玄武", "青龙", "朱雀", "勾陈"},
		"庚": {"白虎", "玄武", "青龙", "朱雀", "勾陈", "螣蛇"},
		"辛": {"白虎", "玄武", "青龙", "朱雀", "勾陈", "螣蛇"},
		"壬": {"玄武", "青龙", "朱雀", "勾陈", "螣蛇", "白虎"},
		"癸": {"玄武", "青龙", "朱雀", "勾陈", "螣蛇", "白虎"},
	}
)
